let handler = async (m, { conn }) => {
    const name = conn.getName(m.sender);
    let videoUrl = 'https://telegra.ph/file/9c0cc8983a7d605d664f3.mp4';
    let tagUser = '@' + m.sender.split("@s.whatsapp.net")[0];
    let more = String.fromCharCode(8206);
    let teks = `${pickRandom([`
    *⋄━──═◟𝘿𝙖𝙗𝙞 𝘽𝙤𝙩💠◟═──━⋄*
*عايز الاوامر* 🙈 ${name}
*⋄━──═◞تعريف البوت📑◟═──━⋄*
*اسم البوت🏷️* :*𝘿𝙖𝙗𝙞 𝘽𝙤𝙩*

*المطور👑*  :https://wa.me/+201110156619@s.whatsapp.net/

*المنصه🖥️* :*Replit*

*لازم تقرأ الملحوظات الي في اخر القائمة 📌*

*⋄━──═◞🗃️الجروبات🗃️◟═──━⋄*

.*انذار←*☢︎︎☠︎︎ 📔🔷
.*الغاء-الانذار←*☢︎︎☠︎︎ 📔🔷
.*احذف←*☢︎︎☠︎︎ 📔🔷
.*ابلاغ←*☢︎︎☠︎︎ 📔🔷
.*الجروب←*☢︎︎☠︎︎ 📔🔷
.*الجروبات←*☢︎︎☠︎︎ 📔🔷
.*استماره←*☢︎︎☠︎︎ 📔🔷
.*دعوه←*☢︎︎☠︎︎ 📔🔷
.*تغير-الوصف←*☢︎︎☠︎︎ 📔🔷
.*تغير-الاسم←*☢︎︎☠︎︎ 📔🔷
.*تغير-الترحيب←*☢︎︎☠︎︎ 📔🔷
.*تغير-الصوره←*☢︎︎☠︎︎ 📔🔷
.*تغير-اللينك←*☢︎︎☠︎︎ 📔🔷
.*الدعم←*☢︎︎☠︎︎ 📔🔷
.*تغير-الوداع←*☢︎︎☠︎︎ 📔🔷
.*تغير-الترحيب←*☢︎︎☠︎︎ 📔🔷
.*منشن←*☢︎︎☠︎︎ 📔🔷
.*مخفي←*☢︎︎☠︎︎ 📔🔷
.*لمنشن←*☢︎︎☠︎︎ 📔🔷
.*منشني←*☢︎︎☠︎︎ 📔🔷
.*جروب فتح←*☢︎︎☠︎︎ 📔🔷
.*جروب غلق←*☢︎︎☠︎︎ 📔🔷
.*اكشف←*☢︎︎☠︎︎ 📔🔷
.*لينك←*☢︎︎☠︎︎ 📔🔷
.*المشرفين←*☢︎︎☠︎︎ 📔🔷
.*الاشباح←*☢︎︎☠︎︎ 📔🔷

*⋄━──═◞🎮الترفيه🎮◟═──━⋄*

.*احزر←*☢︎︎☠︎︎👾🔷
.*كوره←*☢︎︎☠︎︎👾🔷
.*علم←*☢︎︎☠︎︎👾🔷
.*عين←*☢︎︎☠︎︎👾🔷
.*مانغا←*☢︎︎☠︎︎👾🔷
.*شخصيات←*☢︎︎☠︎︎👾🔷
.*رياضيات←*☢︎︎☠︎︎👾🔷
.*شطرنج←*☢︎︎☠︎︎👾🔷
.*اكس او←*☢︎︎☠︎︎👾🔷
.*تفكيك←*☢︎︎☠︎︎👾🔷
.*لعبه←*☢︎︎☠︎︎👾🔷
.*التفعيل←*☢︎︎☠︎︎👾🔷
 .*تسجيل-خروج←*☢︎︎☠︎︎👾🔷
.*راتب←*☢︎︎☠︎︎👾🔷
.*رهان←*☢︎︎☠︎︎👾🔷
.*شراء-جواهر←*☢︎︎☠︎︎👾🔷
.*عديه←*☢︎︎☠︎︎👾🔷
.*شراء-الماس←*☢︎︎☠︎︎👾🔷
.*يومي←*☢︎︎☠︎︎👾🔷
.*البنك←*☢︎︎☠︎︎👾🔷
.*المتصدرين←*☢︎︎☠︎︎👾🔷
.*لفل←*☢︎︎☠︎︎👾🔷
.*الماسي←*☢︎︎☠︎︎👾🔷
.*تعدين←*☢︎︎☠︎︎👾🔷
.*عمله2←*☢︎︎☠︎︎👾🔷
.*رمزي←*☢︎︎☠︎︎👾🔷
.*هجوم←*☢︎︎☠︎︎👾🔷
.*كذبتي←*☢︎︎☠︎︎👾🔷
.*رجولتي←*☢︎︎☠︎︎👾🔷
.*شبيهي←*☢︎︎☠︎︎👾🔷
*لو←*☢︎︎☠︎︎👾🔷
.*ظهر←*☢︎︎☠︎︎👾🔷
.*تسريع←*☢︎︎☠︎︎👾🔷
.*السرعه←*☢︎︎☠︎︎👾🔷
.*خط←*☢︎︎☠︎︎👾🔷
.*زخرفه←*☢︎︎☠︎︎👾🔷
.*فزوره←*☢︎︎☠︎︎👾🔷
.*الشخصيه←*☢︎︎☠︎︎👾🔷
.*صراحه←*☢︎︎☠︎︎👾🔷
.*انصح←*☢︎︎☠︎︎👾🔷
.*تاج←*☢︎︎☠︎︎👾🔷
.*تهكير←*☢︎︎☠︎︎👾🔷
.*غباء←*☢︎︎☠︎︎👾🔷
.*الحب←*☢︎︎☠︎︎👾🔷
.*كت←*☢︎︎☠︎︎👾🔷
.*هل←*☢︎︎☠︎︎👾🔷

*⋄━──═◞🔊صوتيات🔊◟═──━⋄*

.*عميق←*☢︎︎☠︎︎📢🔷
.*منفوخ←*☢︎︎☠︎︎📢🔷
.*تخين←*☢︎︎☠︎︎📢🔷
.*صاخب←*☢︎︎☠︎︎📢🔷
.*سريع←*☢︎︎☠︎︎📢🔷
.*تخينن←*☢︎︎☠︎︎📢🔷
.*رفيع←*☢︎︎☠︎︎📢🔷
.*روبوت←*☢︎︎☠︎︎📢🔷
.*بطيء←*☢︎︎☠︎︎📢🔷
.*ناعم←*☢︎︎☠︎︎📢🔷
.*سنجاب←*☢︎︎☠︎︎📢🔷

*⋄━──═◞🔄تحويلات🔄◟═──━⋄*

.*ملصق←*☢︎︎☠︎︎🔁🔷
.*سرقة←*☢︎︎☠︎︎🔁🔷
.*لفيديو←*☢︎︎☠︎︎🔁🔷
.*لصورة←*☢︎︎☠︎︎🔁🔷
.*لانمي←*☢︎︎☠︎︎🔁🔷
.*تخيل←*☢︎︎☠︎︎🔁🔷
.*مكس←*☢︎︎☠︎︎🔁🔷
.*لجواهر←*☢︎︎☠︎︎🔁🔷
.*ستك←*☢︎︎☠︎︎🔁🔷
.*تلجراف←*☢︎︎☠︎︎🔁🔷
.*لكرتون←*☢︎︎☠︎︎🔁🔷
.*باركود←*☢︎︎☠︎︎🔁🔷
.*دمج←*☢︎︎☠︎︎🔁🔷

*⋄━──═◞⬇️تنزيلات⬇️◟═──━⋄*

.*يوتيوبي←*☢︎︎☠︎︎📩🔷
.*تطبيق←*☢︎︎☠︎︎📩🔷
.*الطقس←*☢︎︎☠︎︎📩🔷
.*تحسين←*☢︎︎☠︎︎📩🔷
*التوقيت←*☢︎︎☠︎︎📩🔷
.*الوان←*☢︎︎☠︎︎📩🔷
.*بوليس←*☢︎︎☠︎︎📩🔷
.*بلور←*☢︎︎☠︎︎📩🔷
.*تشويش←*☢︎︎☠︎︎📩🔷
.*تفريغ←*☢︎︎☠︎︎📩🔷
.*انمي←*☢︎︎☠︎︎📩🔷
.*فيلم←*☢︎︎☠︎︎📩🔷
.*شغل←*☢︎︎☠︎︎📩🔷
.*توكتوك←*☢︎︎☠︎︎📩🔷
.*انستغرام←*☢︎︎☠︎︎📩🔷
.*تلوكولر←*☢︎︎☠︎︎📩🔷
.*انمي←*☢︎︎☠︎︎📩🔷
.*جيتهوب←*☢︎︎☠︎︎📩🔷
.*تحميل←*☢︎︎☠︎︎📩🔷
.*فيسبوك←*☢︎︎☠︎︎📩🔷
.*فريبيك←*☢︎︎☠︎︎📩🔷
.*متجر←*☢︎︎☠︎︎📩🔷
.*بحث←*☢︎︎☠︎︎📩🔷
.*صوره←*☢︎︎☠︎︎📩🔷
.*تخيل←*☢︎︎☠︎︎📩🔷
.*انستا←*☢︎︎☠︎︎📩🔷
.*تيك←*☢︎︎☠︎︎📩🔷
.*صوت←*☢︎︎☠︎︎📩🔷
.*تحسين←*☢︎︎☠︎︎📩🔷
.*لكرتون←*☢︎︎☠︎︎📩🔷
.*لفيديو←*☢︎︎☠︎︎📩🔷

*⋄━──═◞🕋قسم ديني🕋◟═──━⋄*

.*دين←* ☢︎︎☠︎︎❣️🔷
.*ايات←*☢︎︎☠︎︎❣️🔷
.*اسماء-الله←*☢︎︎☠︎︎❣️🔷
.*اذكار الصباح←*☢︎︎☠︎︎❣️🔷
.*اذكار المساء←*☢︎︎☠︎︎❣️🔷

*⋄━──═◞👑قسم المطور👑◟═──━⋄*

.*بريم←*☢︎︎☠︎︎✨🔷
.*خفض-تميز←*☢︎︎☠︎︎✨🔷
.*حظر←*☢︎︎☠︎︎✨🔷
.*فك_حظر←*☢︎︎☠︎︎✨🔷
.*بلوك←*☢︎︎☠︎︎✨🔷
.*رفع-بلوك←*☢︎︎☠︎︎✨🔷
.*اعلان←*☢︎︎☠︎︎✨🔷
.*فيروس←*☢︎︎☠︎︎✨🔷
.*المحظورين←*☢︎︎☠︎︎✨🔷
.*البلوكات←*☢︎︎☠︎︎✨🔷
.*نظف←*☢︎︎☠︎︎✨🔷
.*رسترات←*☢︎︎☠︎︎✨🔷
.*فرمت←*☢︎︎☠︎︎✨🔷
.*اخرج←*☢︎︎☠︎︎✨🔷
.*انضم←*☢︎︎☠︎︎✨🔷
.*نشر←*☢︎︎☠︎︎✨🔷
.*اضف-مطور←*☢︎︎☠︎︎✨🔷
.*اضف_اكسبي←*☢︎︎☠︎︎✨🔷
.*اضف_الماس←*☢︎︎☠︎︎✨🔷
.*بوليجون←*☢︎︎☠︎︎✨🔷
.*اين-الخطاء←*☢︎︎☠︎︎✨🔷

*⋄━──═◟ملحوظة هامة⁉️◟═──━⋄*

*مينفعش تكلم البوت خاص🙅👎*
*لو كلمت البوت خاص سيتم حظرك❌*

*لو عندك امر عايز تضيفه كلم المطور🌠👑*
*ولو أمر ما اشتغلش كلم المطور هيصلحه في تعديلات 🔧*


*ومع تحيات المطور تجربه رائعه للبوت💫*

`])}`.trim();

    conn.sendMessage(m.chat, {
        video: { url: videoUrl },
        caption: teks,
        gifPlayback: true,
        gifAttribution: 0
    }, { quoted: m });
};

handler.command = ['menu', 'help', 'h', 'اوامر', 'مهام', 'الاوامر', 'المهام'];

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
                   }
